SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-69928T-B

Comment( Q1/2 0-8-0 Tank Engine )
Comment( FLIPPED FOR RETURN ROUTE - CHANGE CABS CTRL #E ) 

Type ( Engine )
WagonShape ( BR_Q1-2_69928.s )
Size ( 2.83m 4.25m 10.78m )
Mass ( 73.75t-uk )

Comment( ********* Coupler Information ****************             Included in this section - Type, Spring, Velocity, etc )

	Coupling (
         Type ( Chain )
              	Spring (
			Break ( 600kN 1000kN )
               	r0 ( 20cm 0cm )
              )
     )  

Comment( ********** Brakes, Type, Force, etc *************** )
Comment ( * Locomotive is steam braked * )
BrakeEquipmentType( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 257kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )
MaxHandbrakeForce ( 73kN ) Comment(20% MTW*0.5)
MaxReleaseRate ( 2.5inHg/s ) 
MaxApplicationRate ( 2.0inHg/s )

ORTSBrakeCylinderSize ( 6in ) Comment ( Locomotive has steam brake  )
ORTSAuxilaryResCapacity ( 0.90ft^3 ) Comment ( Vacuum reservoir used for control of steam brake )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 2.5m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 17ft )
Comment(WheelBase = 1.25 x (axles-1) x Drive Diameter)

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(CN 1990 DW x18)
ORTSDavis_A ( 7485 )
ORTSDavis_B ( 24.66 )
ORTSDavis_C ( 5.342 )

ORTSWagonFrontalArea (100ft^2)
ORTSDavisDragConstant (0.0024)

Comments(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights	( 4
			Light	(
			comment( Front White Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 3.2 4.68 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
			Light	(
			comment( Front Red Lamp Reversed Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 4 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddd0000 )
					Position ( 0 3.2 4.68 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
			Light	(
			comment( Rear Red Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 3 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddd0000 )
					Position ( 0 2.76 -5.07 ) 
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
			Light	(
			comment( Rear White Lamp Reversed Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 5 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 2.76 -5.07 ) 
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
		)
	
	
Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

Comment ( ==Passenger View== )
	Inside (
        PassengerCabinFile ( BR_Q1-2_69928.s )
        PassengerCabinHeadPos ( 1.455 2.95 -1 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

	IntakePoint ( 0.9 10 FuelWater )
	IntakePoint ( -0.9 8 FuelCoal )
    
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)


Engine ( OR-69928T-B
    
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
			0 3.80 -1.6
			0 1 0
			0.15
			)
			SafetyValvesFX
			(
			0 3.8 -0.8
			0 1 0
			0.3
			)
			StackFX
			(
			0 4.1 3.9
			0 1 0
			0.5
			)

			CylindersFX
			(
			-1 0.6 4.5
			0 -0.05 1
			0.13
			)
			CylindersFX
			(
			1 0.6 4.5
			0 -0.05 1
			0.13
			)

			Injectors2FX
			(
			-1 0.8 -1.5
			0 -1 0
			0.15
			)
			Injectors1FX
			(
			1 0.8 -1.5
			0 -1 0
			0.15
			)
		)
	)

Wagon ( OR-69928T-B )
Comment ( *************General Information******************                    Included in this section - Wheels, sanding, etc )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 28in )
NumWheels ( 4 )
ORTSDriveWheelWeight ( 73.75t-uk  )  
Sanding ( 25mph )

Comment ( ****************** Boiler ************************          Included in this section - Length, volume, heating area, pressure, etc )

ORTSSteamBoilerType ( Saturated )
BoilerVolume ( 141ft^3 ) 
ORTSEvaporationArea ( 1068ft^2 )
MaxBoilerPressure ( 180psi )
MaxSteamHeatingPressure ( 40psi )

Comment ( ***************** Cylinders **********************         Included in this section - Number, Stroke, Diameter, steam usage, etc )

NumCylinders ( 2 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 19in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  Comment ( Default Setting)

Comment ( ******************* Fire *************************          Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc ) 

ORTSFuelCalorific ( 12390btu/lb ) Comment(Blidworth Coal)
ORTSGrateArea ( 23.62ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )    

Comment ( ******************* Fuel *************************
Included in this section - Coal, water, Tender Presence, etc )

MaxTenderCoalMass ( 4t-uk )
MaxTenderWaterMass ( 20000lb )
IsTenderRequired( 0 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

Comment(ORTSMaxIndicatedHorsepower ( 590.0hp )) 

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 ) Comment(From 4MT Report)

ORTSBurnRate( 0.0 10.0  7875.0 1000.0  12337.0 2000.0  14875.0 2500.0  16275.0 3000.0  18375.0 3500.0 ) Comment(From Pawson Graph)



Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
BrakesEngineBrakeType ( "Steam_brake" )Comment(steam_brake crahes OR in Brake HUD)
TrainPipeLeakRate ( 0.05inHg/s )


Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )

Comment ( ************** Engine Controls ******************** 
Included-Controllers for Regulator, Reverser, Brakes etc) 

EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Locomotive brake based upon Gresham & Craven MkIV Steam Brake Valve )
Brake_Engine ( 0 1 0.25 0.0
NumNotches( 5
Notch( 0.00 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.25 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.50 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.75 0 EngineBrakesControllerBrakeNotchStart )
Notch( 1.00 0 EngineBrakesControllerBrakeNotchStart ) ) )


Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Comment ( ********** Miscellaneous Information *************              Included in this section - Alternate Views, Sounds, Names, Description etc )  

Cabview ( B1.cvf )
HeadOut (  -1.455 2.95 -1 )
 
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
Name ( "69928 Q1/2 Tank, Lamps B, Coal 4t, Water 2000gal, Reverse Cab, TE 25.6Klbf" )
 	Description (
 	"Withdrawal of the Q4 goods locomotives started in 1934, but was delayed by a wartime shortage of goods locomotives. Between 1942 and 1945, Thompson would rebuild thirteen of these Q4s as tank engines for use as heavy shunters. The rebuilds were given the classification of Q1, which had been made vacant by the withdrawal of the last Ivatt Q1 in 1934.
The later batches replaced many of the BTPs (LNER G6), which were then converted to 0-6-0Ts (LNER J77) or push-pull locomotives.\n"+"\n"+

"Initially, Thompson's standardisation plans did not include an 0-8-0T class, but by late 1941 plans were drawn up for an 0-8-0T to replace an order for new J50 0-6-0T shunters. This 0-8-0T was based on a rebuild of the Q4, and rebuilding started almost immediately. The frames, cylinders, and connecting rods were kept. The boiler was shortened to provide space for an fully enclosed cab and the bunker. With the firebox further forward, the valve gear eccentrics had to be moved forward from the third axle to the second axle. Building had already started on some of the parts for the cancelled J50s. Some of these parts were incorporated into the side tanks, cabs, and bunkers of the first Q1s. Usually the weight was distributed so that it was highest on the main driving axles, but the first four Q1s were unusual in that the weight was mainly on the two front axles (19tons maximum axle load).\n"+"\n"+

"The first four engines entered service between June 1942 and March 1943. At a very early stage, there were complaints about the very small water capacity. Hence, the later engines had a longer bunker and were designated Q1/2 whilst the original four were designated Q1/1. The Q1/2s had their frames extended by 6 inches to enable the larger bunkers. The coal capacity of the new bunkers was reduced by half a ton. The end result was an increase in water capacity of 500 gallons. The larger bunkers also influenced the weight distribution. Unlike the Q1/1s, the maximum axle load was on the rear two axles. Nine locomotives were built to the Q1/2 specification.\n"+"\n"+

"Although many of the original Q4s had superheaters, these were removed during rebuilding. Steam brakes were fitted as standard, with a gradable steam brake fitted to all members of the class between 1947 and 1948.\n"+"\n"+

"The new Q1s were tried in a number of places requiring heavy shunting work. They were more powerful than the J50s, but not as powerful as the S1 and T1 heavy shunters. Most were distributed in the Southern Area, although a couple worked in the North Eastern Area and a couple worked in the Scottish Area.\n"+"\n"+

"The Q1s were considered to have roughly equal power abilities as the O4s but were seriously restricted by their lack of water capacity. Although the Q1s showed mixed results at most of the yards where they worked, they were used very successfully at Frodingham. Most of the traffic in the area serviced Scunthorpe's steel mills, and a typical 0-6-0T shunter was far from adequate at shunting these heavy loads. A Q1 could handle them very well, and there were plenty of opportunities to refill the limited water tank.\n"+"\n"+

"Withdrawals started in 1954 and were completed by 1959."
)
)
